mwb-init-lisp.org
#+TITLE Emacs configuration - lisp
#+PROPERTY:header-args :cache yes :tangle (concat "init/" (file-name-base  (buffer-file-name)) ".el") :comments link

#+STARTUP: content

* Lisp running environment
We might try a few but Emacs Lisp is the only one currently

** Common to all

*** Make parentheses pretty
Although that should be in prog mode
	#+begin_src emacs-lisp
 (use-package
   rainbow-delimiters
   :ensure t
   :delight rainbow-delimiters-mode
   :hook (prog-mode . rainbow-delimiters-mode))
	#+end_src

*** Add lisp interaction mode

**** Lispy
	 #+begin_src emacs-lisp
	 (use-package lispy
	   :ensure t
	   :hook ((emacs-lisp-mode lisp-interaction-mode) . lispy-mode))
	 #+end_src

**** and interaction hydra
	 #+begin_src emacs-lisp
	 (use-package lispy-mnemonic
	   :hook ('emacs-lisp-mode . 'lispy-mnemonic-mode)
	   :bind ("H-d" . 'hydra-lispy-debug/body)
	   )
	 #+end_src
** Emacs Lisp
*** Formatter
I am not certain this is needed now as other things do this
#+begin_src  emacs-lisp
(use-package
	elisp-format
	:ensure t)
#+end_src
*** Protect system emacs lisp from editing
Idea come from [[https://github.com/purcell/emacs.d][A Resonable Emacs]]
**** Increase list to exclude Aquamacs etc.
Look at directory variables and then use a customised list to hold directories, loop/map setting them See [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Directory-Variables.html#Directory-Variables][Gnu Emacs Manual]]
#+begin_src emacs-lisp
   (defun sanityinc/maybe-set-bundled-elisp-readonly ()
	 "If this elisp appears to be part of Emacs, then disallow editing."
	 (when (and (buffer-file-name)
				(string-match-p "\\.el\\.gz\\'" (buffer-file-name)))
       (setq buffer-read-only t)
       (view-mode 1)))

   (add-hook 'emacs-lisp-mode-hook 'sanityinc/maybe-set-bundled-elisp-readonly)
#+end_src
*** Keyboard Macros
Well not really lisp but much can be converted to it
**** Show as emacs lisp
   #+begin_src emacs-lisp
   (use-package elmacro :ensure t)
   #+end_src
